{
  "nodes": [
    {
      "op": "null", 
      "name": "Age_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Age_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Age_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Age_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Age_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Age_numeric_fullyconnected1_weight", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Age_numeric_fullyconnected1_bias", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Age_numeric_fullyconnected1", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Age_numeric_activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Sex_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Sex_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Sex_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Sex_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Sex_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RestBP_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Chol_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Chol_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Chol_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Chol_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Chol_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Chol_numeric_fullyconnected1_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Chol_numeric_fullyconnected1_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Chol_numeric_fullyconnected1", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Chol_numeric_activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Fbs_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Fbs_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Fbs_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Fbs_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Fbs_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ExAng_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ExAng_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ExAng_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "ExAng_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ExAng_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ExAng_numeric_fullyconnected1_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ExAng_numeric_fullyconnected1_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "ExAng_numeric_fullyconnected1", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ExAng_numeric_activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RestECG_numeric", 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "7"
      }, 
      "inputs": [[8, 0, 0], [13, 0, 0], [14, 0, 0], [23, 0, 0], [28, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_MaxHR_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_MaxHR_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_MaxHR", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "MaxHR", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus1", 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "_powerscalar1", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1", 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar1", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div1", 
      "inputs": [[46, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum3", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar3", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum2", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar2", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[51, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss1", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-MaxHR", 
      "inputs": [[42, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    9, 
    10, 
    11, 
    14, 
    15, 
    16, 
    17, 
    20, 
    21, 
    24, 
    25, 
    26, 
    29, 
    30, 
    31, 
    34, 
    35, 
    38, 
    40, 
    41, 
    43
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57
  ], 
  "heads": [[55, 0, 0], [56, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}