{
  "nodes": [
    {
      "op": "null", 
      "name": "Age_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Age_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Age_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Age_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Age_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Sex_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Sex_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Sex_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Sex_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Sex_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RestBP_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RestBP_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RestBP_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "RestBP_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "RestBP_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Chol_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Chol_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Chol_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Chol_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Chol_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Fbs_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Fbs_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Fbs_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Fbs_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Fbs_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ExAng_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ExAng_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ExAng_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "ExAng_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ExAng_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RestECG_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RestECG_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RestECG_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "RestECG_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "RestECG_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "7"
      }, 
      "inputs": [[4, 0, 0], [9, 0, 0], [14, 0, 0], [19, 0, 0], [24, 0, 0], [29, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_ChestPain_weight", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_ChestPain_bias", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_ChestPain", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "log_softmax", 
      "name": "log_softmax0", 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ChestPain", 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.0"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar1", 
      "attrs": {"scalar": "5"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser0", 
      "inputs": [[40, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[40, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "pick", 
      "name": "pick0", 
      "inputs": [[39, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "-1"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like0", 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater0", 
      "inputs": [[45, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[47, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "__empirical_risk_instance_weight__", 
      "inputs": []
    }, 
    {
      "op": "pick", 
      "name": "pick1", 
      "inputs": [[51, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[50, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar2", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div1", 
      "inputs": [[53, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like0", 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[56, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1", 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar3", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div2", 
      "inputs": [[59, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum3", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar3", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum2", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar2", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul2", 
      "inputs": [[64, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss1", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax0", 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-ChestPain", 
      "inputs": [[69, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    7, 
    10, 
    11, 
    12, 
    15, 
    16, 
    17, 
    20, 
    21, 
    22, 
    25, 
    26, 
    27, 
    30, 
    31, 
    32, 
    36, 
    37, 
    40, 
    51
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71
  ], 
  "heads": [[68, 0, 0], [70, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}