{
  "nodes": [
    {
      "op": "null", 
      "name": "numerical_features-q6ITZM5jtg", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-q6ITZM5jtg_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-q6ITZM5jtg_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "numerical_features-q6ITZM5jtg_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "numerical_features-q6ITZM5jtg_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat23", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_ChestPain_weight", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_ChestPain_bias", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_ChestPain", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "log_softmax", 
      "name": "log_softmax11", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ChestPain", 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar22", 
      "attrs": {"scalar": "0.0"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar45", 
      "attrs": {"scalar": "5"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser11", 
      "inputs": [[10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul33", 
      "inputs": [[10, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split11", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "pick", 
      "name": "pick22", 
      "inputs": [[9, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar23", 
      "attrs": {"scalar": "-1"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like11", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater11", 
      "inputs": [[15, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul34", 
      "inputs": [[17, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "__empirical_risk_instance_weight__", 
      "inputs": []
    }, 
    {
      "op": "pick", 
      "name": "pick23", 
      "inputs": [[21, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul35", 
      "inputs": [[20, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum34", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar46", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div34", 
      "inputs": [[23, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like11", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum35", 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul34", 
      "inputs": [[26, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean23", 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar47", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div35", 
      "inputs": [[29, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum47", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar47", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum46", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar46", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul35", 
      "inputs": [[34, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss23", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax11", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-ChestPain", 
      "inputs": [[39, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 6, 7, 10, 21], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41
  ], 
  "heads": [[38, 0, 0], [40, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}