{
  "nodes": [
    {
      "op": "null", 
      "name": "Age", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Age_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Age_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Age_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Age_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Sex", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Sex_embedding0_weight", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "Sex_embedding0", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Sex_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Sex_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Sex_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RestBP", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RestBP_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RestBP_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "RestBP_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "RestBP_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Chol", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Chol_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Chol_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Chol_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "Chol_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Fbs", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Fbs_embedding0_weight", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "Fbs_embedding0", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Fbs_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Fbs_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "Fbs_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ExAng", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ExAng_embedding0_weight", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "ExAng_embedding0", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ExAng_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ExAng_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "ExAng_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RestECG", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RestECG_embedding0_weight", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "RestECG_embedding0", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RestECG_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RestECG_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "RestECG_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat12", 
      "attrs": {
        "dim": "1", 
        "num_args": "7"
      }, 
      "inputs": [[4, 0, 0], [10, 0, 0], [15, 0, 0], [20, 0, 0], [26, 0, 0], [32, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_MaxHR_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_MaxHR_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_MaxHR", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "MaxHR", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus11", 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "_powerscalar11", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum13", 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean12", 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar14", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div13", 
      "inputs": [[46, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum25", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar25", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum24", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar24", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul13", 
      "inputs": [[51, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss12", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-MaxHR", 
      "inputs": [[42, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    8, 
    9, 
    11, 
    12, 
    13, 
    16, 
    17, 
    18, 
    21, 
    22, 
    24, 
    25, 
    27, 
    28, 
    30, 
    31, 
    33, 
    34, 
    36, 
    37, 
    40, 
    41, 
    43
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57
  ], 
  "heads": [[55, 0, 0], [56, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}